In [32]:
# че пацаны, библиотека пандас?
import pandas as pd

In [33]:
sr = pd.Series([1,2,3,4,5])
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [34]:
sr.index

RangeIndex(start=0, stop=5, step=1)

In [35]:
f = [1, 2, 3, 4, -5, 6]
f = list(filter(lambda x: x > 0, f))
f

[1, 2, 3, 4, 6]

In [36]:
sr.apply(lambda x : x ** 2)

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [42]:
sr = pd.Series([100,200,300], index = ['Moscow','Mytischi','Severobaykalsk'])
sr[0] == sr['Moscow']

True

In [43]:
sr[['Moscow','Severobaykalsk']]

Moscow            100
Severobaykalsk    300
dtype: int64

In [44]:
sr['Moscow' : 'Severobaykalsk']

Moscow            100
Mytischi          200
Severobaykalsk    300
dtype: int64

In [45]:
#sr[['Moscow','Severobaykalsk']] = 0
sr

Moscow            100
Mytischi          200
Severobaykalsk    300
dtype: int64

In [46]:
sr[sr > 100]

Mytischi          200
Severobaykalsk    300
dtype: int64

In [47]:
sr > 100

Moscow            False
Mytischi           True
Severobaykalsk     True
dtype: bool

In [50]:
sr * 2

Moscow            200
Mytischi          400
Severobaykalsk    600
dtype: int64

In [58]:
sr = pd.Series([100,200,300])
sr = sr.append(pd.Series([400,]), ignore_index=True)
sr

0    100
1    200
2    300
3    400
dtype: int64

In [59]:
sr = pd.Series(
    {
        'Moscow': 5000000,
        'Mytischi': 70000,
        'Severobaykalsk' : 300,
    }
)
sr

Moscow            5000000
Mytischi            70000
Severobaykalsk        300
dtype: int64

In [69]:
sr.index = sr.index.to_series().apply(lambda x: x[:2].upper())
sr

MO    5000000
MY      70000
SE        300
dtype: int64

In [70]:
'MO' in sr

True

In [75]:
df = pd.DataFrame({
    'name':['Yandex','PM','HSE','Mytischi','Pushkino','Korolev'],
    'students_num': [300,300,200,500,100,100],
    'city': ['Moscow','Moscow','Moscow','Mytischi','Pushkino','Korolev'],
    'weekday_classes' : [False,True,True,True,True,True],
})
df

       name  students_num      city  weekday_classes
0    Yandex           300    Moscow            False
1        PM           300    Moscow             True
2       HSE           200    Moscow             True
3  Mytischi           500  Mytischi             True
4  Pushkino           100  Pushkino             True
5   Korolev           100   Korolev             True

In [80]:
df.head(2) #вывести первые n строк (по умолчанию 5)

     name  students_num    city  weekday_classes
0  Yandex           300  Moscow            False
1      PM           300  Moscow             True

In [79]:
df.tail(2)# те же яцйа, только в профиль

       name  students_num      city  weekday_classes
4  Pushkino           100  Pushkino             True
5   Korolev           100   Korolev             True

In [82]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [84]:
df['name'] # df[0] - не работает

0      Yandex
1          PM
2         HSE
3    Mytischi
4    Pushkino
5     Korolev
Name: name, dtype: object

In [88]:
df[df['city'] == 'Moscow']

     name  students_num    city  weekday_classes
0  Yandex           300  Moscow            False
1      PM           300  Moscow             True
2     HSE           200  Moscow             True

In [93]:
df[(df['city'] == 'Moscow') | (df['city'] == 'Mytischi')] # | - оператор или, & - и

       name  students_num      city  weekday_classes
0    Yandex           300    Moscow            False
1        PM           300    Moscow             True
2       HSE           200    Moscow             True
3  Mytischi           500  Mytischi             True

In [95]:
df[(df['name'] == 'Yandex') & (df['city'] == 'Moscow')]

     name  students_num    city  weekday_classes
0  Yandex           300  Moscow            False

In [96]:
df.columns

Index(['name', 'students_num', 'city', 'weekday_classes'], dtype='object')

In [97]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [100]:
df['kek'] = 'kek'
df

       name  students_num      city  weekday_classes  kek
0    Yandex           300    Moscow            False  kek
1        PM           300    Moscow             True  kek
2       HSE           200    Moscow             True  kek
3  Mytischi           500  Mytischi             True  kek
4  Pushkino           100  Pushkino             True  kek
5   Korolev           100   Korolev             True  kek

In [104]:
df.drop('kek',axis = 'columns')

       name  students_num      city  weekday_classes
0    Yandex           300    Moscow            False
1        PM           300    Moscow             True
2       HSE           200    Moscow             True
3  Mytischi           500  Mytischi             True
4  Pushkino           100  Pushkino             True
5   Korolev           100   Korolev             True

In [107]:
df['is_unique'] = (df['name'] == df['city']) # выражение
df

       name  students_num      city  weekday_classes  kek  is_unique
0    Yandex           300    Moscow            False  kek      False
1        PM           300    Moscow             True  kek      False
2       HSE           200    Moscow             True  kek      False
3  Mytischi           500  Mytischi             True  kek       True
4  Pushkino           100  Pushkino             True  kek       True
5   Korolev           100   Korolev             True  kek       True

In [112]:
df.index = df['name'].apply(lambda x: x[:2].upper())
df.index.name = "Code"
df

          name  students_num      city  weekday_classes  kek  is_unique
Code
YA      Yandex           300    Moscow            False  kek      False
PM          PM           300    Moscow             True  kek      False
HS         HSE           200    Moscow             True  kek      False
MY    Mytischi           500  Mytischi             True  kek       True
PU    Pushkino           100  Pushkino             True  kek       True
KO     Korolev           100   Korolev             True  kek       True

In [115]:
df[df['weekday_classes']]

          name  students_num      city  weekday_classes  kek  is_unique
Code
PM          PM           300    Moscow             True  kek      False
HS         HSE           200    Moscow             True  kek      False
MY    Mytischi           500  Mytischi             True  kek       True
PU    Pushkino           100  Pushkino             True  kek       True
KO     Korolev           100   Korolev             True  kek       True

In [117]:
df[(df['weekday_classes']) & (df['is_unique'])]

          name  students_num      city  weekday_classes  kek  is_unique
Code
MY    Mytischi           500  Mytischi             True  kek       True
PU    Pushkino           100  Pushkino             True  kek       True
KO     Korolev           100   Korolev             True  kek       True

In [118]:
for x in df:
    print(x)

name
students_num
city
weekday_classes
kek
is_unique

In [120]:
df.loc['YA':'HS',['city','students_num']]

        city  students_num
Code
YA    Moscow           300
PM    Moscow           300
HS    Moscow           200

In [122]:
df

          name  students_num      city  weekday_classes  kek  is_unique
Code
YA      Yandex           300    Moscow            False  kek      False
PM          PM           300    Moscow             True  kek      False
HS         HSE           200    Moscow             True  kek      False
MY    Mytischi           500  Mytischi             True  kek       True
PU    Pushkino           100  Pushkino             True  kek       True
KO     Korolev           100   Korolev             True  kek       True

In [121]:
df.iloc[2:4]

          name  students_num      city  weekday_classes  kek  is_unique
Code
HS         HSE           200    Moscow             True  kek      False
MY    Mytischi           500  Mytischi             True  kek       True

In [128]:
df.loc[df['students_num'] > 200][['name','city']]

          name      city
Code
YA      Yandex    Moscow
PM          PM    Moscow
MY    Mytischi  Mytischi